{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<SEP>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": ""
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "<BOS>": {
        "id": "<BOS>",
        "ids": [
          2
        ],
        "tokens": [
          "<BOS>"
        ]
      },
      "<EOS>": {
        "id": "<EOS>",
        "ids": [
          0
        ],
        "tokens": [
          "<EOS>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<EOS>": 0,
      "<PAD>": 1,
      "<BOS>": 2,
      "<SEP>": 3,
      "<UNK>": 4,
      "\u0005": 5,
      "\u0006": 6,
      "\u0007": 7,
      "\b": 8,
      "\t": 9,
      "\n": 10,
      "\u000b": 11,
      "\f": 12,
      "\r": 13,
      "\u000e": 14,
      "\u000f": 15,
      "\u0010": 16,
      "\u0011": 17,
      "\u0012": 18,
      "\u0013": 19,
      "\u0014": 20,
      "\u0015": 21,
      "\u0016": 22,
      "\u0017": 23,
      "\u0018": 24,
      "\u0019": 25,
      "\u001a": 26,
      "\u001b": 27,
      "\u001c": 28,
      "\u001d": 29,
      "\u001e": 30,
      "\u001f": 31,
      " ": 32,
      "!": 33,
      "\"": 34,
      "#": 35,
      "$": 36,
      "%": 37,
      "&": 38,
      "'": 39,
      "(": 40,
      ")": 41,
      "*": 42,
      "+": 43,
      ",": 44,
      "-": 45,
      ".": 46,
      "/": 47,
      "0": 48,
      "1": 49,
      "2": 50,
      "3": 51,
      "4": 52,
      "5": 53,
      "6": 54,
      "7": 55,
      "8": 56,
      "9": 57,
      ":": 58,
      ";": 59,
      "<": 60,
      "=": 61,
      ">": 62,
      "?": 63,
      "@": 64,
      "A": 65,
      "B": 66,
      "C": 67,
      "D": 68,
      "E": 69,
      "F": 70,
      "G": 71,
      "H": 72,
      "I": 73,
      "J": 74,
      "K": 75,
      "L": 76,
      "M": 77,
      "N": 78,
      "O": 79,
      "P": 80,
      "Q": 81,
      "R": 82,
      "S": 83,
      "T": 84,
      "U": 85,
      "V": 86,
      "W": 87,
      "X": 88,
      "Y": 89,
      "Z": 90,
      "[": 91,
      "\\": 92,
      "]": 93,
      "^": 94,
      "_": 95,
      "`": 96,
      "a": 97,
      "b": 98,
      "c": 99,
      "d": 100,
      "e": 101,
      "f": 102,
      "g": 103,
      "h": 104,
      "i": 105,
      "j": 106,
      "k": 107,
      "l": 108,
      "m": 109,
      "n": 110,
      "o": 111,
      "p": 112,
      "q": 113,
      "r": 114,
      "s": 115,
      "t": 116,
      "u": 117,
      "v": 118,
      "w": 119,
      "x": 120,
      "y": 121,
      "z": 122,
      "{": 123,
      "|": 124,
      "}": 125,
      "~": 126,
      "": 127,
      "": 128,
      "": 129,
      "": 130,
      "": 131,
      "": 132,
      "": 133,
      "": 134,
      "": 135,
      "": 136,
      "": 137,
      "": 138,
      "": 139,
      "": 140,
      "": 141,
      "": 142,
      "": 143,
      "": 144,
      "": 145,
      "": 146,
      "": 147,
      "": 148,
      "": 149,
      "": 150,
      "": 151,
      "": 152,
      "": 153,
      "": 154,
      "": 155,
      "": 156,
      "": 157,
      "": 158,
      "": 159,
      " ": 160,
      "¡": 161,
      "¢": 162,
      "£": 163,
      "¤": 164,
      "¥": 165,
      "¦": 166,
      "§": 167,
      "¨": 168,
      "©": 169,
      "ª": 170,
      "«": 171,
      "¬": 172,
      "­": 173,
      "®": 174,
      "¯": 175,
      "°": 176,
      "±": 177,
      "²": 178,
      "³": 179,
      "´": 180,
      "µ": 181,
      "¶": 182,
      "·": 183,
      "¸": 184,
      "¹": 185,
      "º": 186,
      "»": 187,
      "¼": 188,
      "½": 189,
      "¾": 190,
      "¿": 191,
      "À": 192,
      "Á": 193,
      "Â": 194,
      "Ã": 195,
      "Ä": 196,
      "Å": 197,
      "Æ": 198,
      "Ç": 199,
      "È": 200,
      "É": 201,
      "Ê": 202,
      "Ë": 203,
      "Ì": 204,
      "Í": 205,
      "Î": 206,
      "Ï": 207,
      "Ð": 208,
      "Ñ": 209,
      "Ò": 210,
      "Ó": 211,
      "Ô": 212,
      "Õ": 213,
      "Ö": 214,
      "×": 215,
      "Ø": 216,
      "Ù": 217,
      "Ú": 218,
      "Û": 219,
      "Ü": 220,
      "Ý": 221,
      "Þ": 222,
      "ß": 223,
      "à": 224,
      "á": 225,
      "â": 226,
      "ã": 227,
      "ä": 228,
      "å": 229,
      "æ": 230,
      "ç": 231,
      "è": 232,
      "é": 233,
      "ê": 234,
      "ë": 235,
      "ì": 236,
      "í": 237,
      "î": 238,
      "ï": 239,
      "ð": 240,
      "ñ": 241,
      "ò": 242,
      "ó": 243,
      "ô": 244,
      "õ": 245,
      "ö": 246,
      "÷": 247,
      "ø": 248,
      "ù": 249,
      "ú": 250,
      "û": 251,
      "ü": 252,
      "ý": 253,
      "þ": 254,
      "ÿ": 255,
      "Ā": 256,
      "ā": 257,
      "Ă": 258,
      "ă": 259,
      "Ą": 260,
      "ą": 261,
      "Ć": 262,
      "ć": 263,
      "Ĉ": 264,
      "ĉ": 265,
      "Ċ": 266,
      "ċ": 267,
      "Č": 268,
      "č": 269,
      "Ď": 270,
      "ď": 271,
      "Đ": 272,
      "đ": 273,
      "Ē": 274,
      "ē": 275,
      "Ĕ": 276,
      "ĕ": 277,
      "Ė": 278,
      "ė": 279,
      "Ę": 280,
      "ę": 281,
      "Ě": 282,
      "ě": 283,
      "Ĝ": 284,
      "ĝ": 285,
      "Ğ": 286,
      "ğ": 287,
      "Ġ": 288,
      "ġ": 289,
      "Ģ": 290,
      "ģ": 291,
      "Ĥ": 292,
      "ĥ": 293,
      "Ħ": 294,
      "ħ": 295,
      "Ĩ": 296,
      "ĩ": 297,
      "Ī": 298,
      "ī": 299,
      "Ĭ": 300,
      "ĭ": 301,
      "Į": 302,
      "į": 303,
      "İ": 304,
      "ı": 305,
      "Ĳ": 306,
      "ĳ": 307,
      "Ĵ": 308,
      "ĵ": 309,
      "Ķ": 310,
      "ķ": 311,
      "ĸ": 312,
      "Ĺ": 313,
      "ĺ": 314,
      "Ļ": 315,
      "ļ": 316,
      "Ľ": 317,
      "ľ": 318,
      "Ŀ": 319,
      "ŀ": 320,
      "Ł": 321,
      "ł": 322,
      "Ń": 323,
      "ń": 324,
      "Ņ": 325,
      "ņ": 326,
      "Ň": 327,
      "ň": 328,
      "ŉ": 329,
      "Ŋ": 330,
      "ŋ": 331,
      "Ō": 332,
      "ō": 333,
      "Ŏ": 334,
      "ŏ": 335,
      "Ő": 336,
      "ő": 337,
      "Œ": 338,
      "œ": 339,
      "Ŕ": 340,
      "ŕ": 341,
      "Ŗ": 342,
      "ŗ": 343,
      "Ř": 344,
      "ř": 345,
      "Ś": 346,
      "ś": 347,
      "Ŝ": 348,
      "ŝ": 349,
      "Ş": 350,
      "ş": 351,
      "Š": 352,
      "š": 353,
      "Ţ": 354,
      "ţ": 355,
      "Ť": 356,
      "ť": 357,
      "Ŧ": 358,
      "ŧ": 359,
      "Ũ": 360,
      "ũ": 361,
      "Ū": 362,
      "ū": 363,
      "Ŭ": 364,
      "ŭ": 365,
      "Ů": 366,
      "ů": 367,
      "Ű": 368,
      "ű": 369,
      "Ų": 370,
      "ų": 371,
      "Ŵ": 372,
      "ŵ": 373,
      "Ŷ": 374,
      "ŷ": 375,
      "Ÿ": 376,
      "Ź": 377,
      "ź": 378,
      "Ż": 379,
      "ż": 380,
      "Ž": 381,
      "ž": 382,
      "ſ": 383,
      "ƀ": 384,
      "Ɓ": 385,
      "Ƃ": 386,
      "ƃ": 387,
      "Ƅ": 388,
      "ƅ": 389,
      "Ɔ": 390,
      "Ƈ": 391,
      "ƈ": 392,
      "Ɖ": 393,
      "Ɗ": 394,
      "Ƌ": 395,
      "ƌ": 396,
      "ƍ": 397,
      "Ǝ": 398,
      "Ə": 399,
      "Ɛ": 400,
      "Ƒ": 401,
      "ƒ": 402,
      "Ɠ": 403,
      "Ɣ": 404,
      "ƕ": 405,
      "Ɩ": 406,
      "Ɨ": 407,
      "Ƙ": 408,
      "ƙ": 409,
      "ƚ": 410,
      "ƛ": 411,
      "Ɯ": 412,
      "Ɲ": 413,
      "ƞ": 414,
      "Ɵ": 415,
      "Ơ": 416,
      "ơ": 417,
      "Ƣ": 418,
      "ƣ": 419,
      "Ƥ": 420,
      "ƥ": 421,
      "Ʀ": 422,
      "Ƨ": 423,
      "ƨ": 424,
      "Ʃ": 425,
      "ƪ": 426,
      "ƫ": 427,
      "Ƭ": 428,
      "ƭ": 429,
      "Ʈ": 430,
      "Ư": 431,
      "ư": 432,
      "Ʊ": 433,
      "Ʋ": 434,
      "Ƴ": 435,
      "ƴ": 436,
      "Ƶ": 437,
      "ƶ": 438,
      "Ʒ": 439,
      "Ƹ": 440,
      "ƹ": 441,
      "ƺ": 442,
      "ƻ": 443,
      "Ƽ": 444,
      "ƽ": 445,
      "ƾ": 446,
      "ƿ": 447,
      "ǀ": 448,
      "ǁ": 449,
      "ǂ": 450,
      "ǃ": 451,
      "Ǆ": 452,
      "ǅ": 453,
      "ǆ": 454,
      "Ǉ": 455,
      "ǈ": 456,
      "ǉ": 457,
      "Ǌ": 458,
      "ǋ": 459,
      "ǌ": 460,
      "Ǎ": 461,
      "ǎ": 462,
      "Ǐ": 463,
      "ǐ": 464,
      "Ǒ": 465,
      "ǒ": 466,
      "Ǔ": 467,
      "ǔ": 468,
      "Ǖ": 469,
      "ǖ": 470,
      "Ǘ": 471,
      "ǘ": 472,
      "Ǚ": 473,
      "ǚ": 474,
      "Ǜ": 475,
      "ǜ": 476,
      "ǝ": 477,
      "Ǟ": 478,
      "ǟ": 479,
      "Ǡ": 480,
      "ǡ": 481,
      "Ǣ": 482,
      "ǣ": 483,
      "Ǥ": 484,
      "ǥ": 485,
      "Ǧ": 486,
      "ǧ": 487,
      "Ǩ": 488,
      "ǩ": 489,
      "Ǫ": 490,
      "ǫ": 491,
      "Ǭ": 492,
      "ǭ": 493,
      "Ǯ": 494,
      "ǯ": 495,
      "ǰ": 496,
      "Ǳ": 497,
      "ǲ": 498,
      "ǳ": 499,
      "Ǵ": 500,
      "ǵ": 501,
      "Ƕ": 502,
      "Ƿ": 503,
      "Ǹ": 504,
      "ǹ": 505,
      "Ǻ": 506,
      "ǻ": 507,
      "Ǽ": 508,
      "ǽ": 509,
      "Ǿ": 510,
      "ǿ": 511
    },
    "unk_token": "<UNK>"
  }
}
