{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<EOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<BOS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Split",
    "pattern": {
      "String": ""
    },
    "behavior": "Isolated",
    "invert": false
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<BOS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<EOS>",
          "type_id": 0
        }
      }
    ],
    "special_tokens": {
      "<BOS>": {
        "id": "<BOS>",
        "ids": [
          2
        ],
        "tokens": [
          "<BOS>"
        ]
      },
      "<EOS>": {
        "id": "<EOS>",
        "ids": [
          0
        ],
        "tokens": [
          "<EOS>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Fuse"
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<EOS>": 0,
      "<PAD>": 1,
      "<BOS>": 2,
      "<UNK>": 3,
      "\u0004": 4,
      "\u0005": 5,
      "\u0006": 6,
      "\u0007": 7,
      "\b": 8,
      "\t": 9,
      "\n": 10,
      "\u000b": 11,
      "\f": 12,
      "\r": 13,
      "\u000e": 14,
      "\u000f": 15,
      "\u0010": 16,
      "\u0011": 17,
      "\u0012": 18,
      "\u0013": 19,
      "\u0014": 20,
      "\u0015": 21,
      "\u0016": 22,
      "\u0017": 23,
      "\u0018": 24,
      "\u0019": 25,
      "\u001a": 26,
      "\u001b": 27,
      "\u001c": 28,
      "\u001d": 29,
      "\u001e": 30,
      "\u001f": 31,
      " ": 32,
      "!": 33,
      "\"": 34,
      "#": 35,
      "$": 36,
      "%": 37,
      "&": 38,
      "'": 39,
      "(": 40,
      ")": 41,
      "*": 42,
      "+": 43,
      ",": 44,
      "-": 45,
      ".": 46,
      "/": 47,
      "0": 48,
      "1": 49,
      "2": 50,
      "3": 51,
      "4": 52,
      "5": 53,
      "6": 54,
      "7": 55,
      "8": 56,
      "9": 57,
      ":": 58,
      ";": 59,
      "<": 60,
      "=": 61,
      ">": 62,
      "?": 63,
      "@": 64,
      "A": 65,
      "B": 66,
      "C": 67,
      "D": 68,
      "E": 69,
      "F": 70,
      "G": 71,
      "H": 72,
      "I": 73,
      "J": 74,
      "K": 75,
      "L": 76,
      "M": 77,
      "N": 78,
      "O": 79,
      "P": 80,
      "Q": 81,
      "R": 82,
      "S": 83,
      "T": 84,
      "U": 85,
      "V": 86,
      "W": 87,
      "X": 88,
      "Y": 89,
      "Z": 90,
      "[": 91,
      "\\": 92,
      "]": 93,
      "^": 94,
      "_": 95,
      "`": 96,
      "a": 97,
      "b": 98,
      "c": 99,
      "d": 100,
      "e": 101,
      "f": 102,
      "g": 103,
      "h": 104,
      "i": 105,
      "j": 106,
      "k": 107,
      "l": 108,
      "m": 109,
      "n": 110,
      "o": 111,
      "p": 112,
      "q": 113,
      "r": 114,
      "s": 115,
      "t": 116,
      "u": 117,
      "v": 118,
      "w": 119,
      "x": 120,
      "y": 121,
      "z": 122,
      "{": 123,
      "|": 124,
      "}": 125,
      "~": 126,
      "": 127,
      "聙": 128,
      "聛": 129,
      "聜": 130,
      "聝": 131,
      "聞": 132,
      "聟": 133,
      "聠": 134,
      "聡": 135,
      "聢": 136,
      "聣": 137,
      "聤": 138,
      "聥": 139,
      "聦": 140,
      "聧": 141,
      "聨": 142,
      "聫": 143,
      "聬": 144,
      "聭": 145,
      "聮": 146,
      "聯": 147,
      "聰": 148,
      "聲": 149,
      "聳": 150,
      "聴": 151,
      "聵": 152,
      "聶": 153,
      "職": 154,
      "聸": 155,
      "聹": 156,
      "聺": 157,
      "聻": 158,
      "聼": 159,
      "聽": 160,
      "隆": 161,
      "垄": 162,
      "拢": 163,
      "陇": 164,
      "楼": 165,
      "娄": 166,
      "搂": 167,
      "篓": 168,
      "漏": 169,
      "陋": 170,
      "芦": 171,
      "卢": 172,
      "颅": 173,
      "庐": 174,
      "炉": 175,
      "掳": 176,
      "卤": 177,
      "虏": 178,
      "鲁": 179,
      "麓": 180,
      "碌": 181,
      "露": 182,
      "路": 183,
      "赂": 184,
      "鹿": 185,
      "潞": 186,
      "禄": 187,
      "录": 188,
      "陆": 189,
      "戮": 190,
      "驴": 191,
      "脌": 192,
      "脕": 193,
      "脗": 194,
      "脙": 195,
      "脛": 196,
      "脜": 197,
      "脝": 198,
      "脟": 199,
      "脠": 200,
      "脡": 201,
      "脢": 202,
      "脣": 203,
      "脤": 204,
      "脥": 205,
      "脦": 206,
      "脧": 207,
      "脨": 208,
      "脩": 209,
      "脪": 210,
      "脫": 211,
      "脭": 212,
      "脮": 213,
      "脰": 214,
      "脳": 215,
      "脴": 216,
      "脵": 217,
      "脷": 218,
      "脹": 219,
      "脺": 220,
      "脻": 221,
      "脼": 222,
      "脽": 223,
      "脿": 224,
      "谩": 225,
      "芒": 226,
      "茫": 227,
      "盲": 228,
      "氓": 229,
      "忙": 230,
      "莽": 231,
      "猫": 232,
      "茅": 233,
      "锚": 234,
      "毛": 235,
      "矛": 236,
      "铆": 237,
      "卯": 238,
      "茂": 239,
      "冒": 240,
      "帽": 241,
      "貌": 242,
      "贸": 243,
      "么": 244,
      "玫": 245,
      "枚": 246,
      "梅": 247,
      "酶": 248,
      "霉": 249,
      "煤": 250,
      "没": 251,
      "眉": 252,
      "媒": 253,
      "镁": 254,
      "每": 255
    },
    "unk_token": "<UNK>"
  }
}
